app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `nama_lengkap` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $user = $this->usersModel;
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $validasi = $user->where('nama_lengkap', $username)->first();