app/Controllers/Auth.php

    public function login()
    {
        $user = $this->usersModel;
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $validasi = $user->where('nik', $username)->first();
---
SELECT *
FROM `users`
WHERE `nik` = 'admin'
 LIMIT 1